CanUseDepthCueing Method
 Indicates if view can use Depth Cueing
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017
 Syntax
  C#
public bool CanUseDepthCueing()
  Visual Basic
Public Function CanUseDepthCueing As Boolean
  Visual C++
public:
bool CanUseDepthCueing()
 Return Value
 True if view can use Depth Cueing
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →